package com.sunny.module.stu.A基础知识;

import com.sunny.module.stu.base.StuImpl;

public class E设计模式 extends StuImpl {

    @Override
    public void a_是什么() {
        /*
        创建型模式，结构型模式，行为型模式

        设计模式（Design pattern）代表了最佳的实践，通常被有经验的面向对象的软件开发人员所采用。
        设计模式是软件开发人员在软件开发过程中面临的一般问题的解决方案。
        这些解决方案是众多软件开发人员经过相当长的一段时间的试验和错误总结出来的。

        设计模式是一套被反复使用的、多数人知晓的、经过分类编目的、代码设计经验的总结。
        使用设计模式是为了重用代码、让代码更容易被他人理解、保证代码可靠性。
        毫无疑问，设计模式于己于他人于系统都是多赢的，设计模式使代码编制真正工程化，设计模式是软件工程的基石，如同大厦的一块块砖石一样。
        项目中合理地运用设计模式可以完美地解决很多问题，每种模式在现实中都有相应的原理来与之对应，
        每种模式都描述了一个在我们周围不断重复发生的问题，以及该问题的核心解决方案，这也是设计模式能被广泛应用的原因
         */
    }

    @Override
    public void c_功能() {
        // 创建型设计模式
        /*
        这类模式与对象的创建有关，提供了创建对象的最佳实践方式

        单例模式：
            确保一个类只有一个实例，并提供全局访问点
        工厂模式：
            提供一个接口用于创建对象，但允许子类决定实例化哪个类
        抽象工厂模式：
            提供一个接口来创建一系列相关或相互依赖的对象，而无需指定它们具体的类
        *** 如果应用只需要创建一类对象，那么使用工厂模式就足够了。但如果需要创建的对象是一组相关或相互依赖的对象，那么抽象工厂模式就更合适 ***
        原型模式：
            通过复制现有的实例来创建新的对象
         */

        // 结构型设计模式
        /*
        这类模式涉及到类和对象的组合，形成复杂的结构

        适配器模式：
            允许将一个类的接口转换成客户希望的另一个接口。适配器模式使得原本由于接口不兼容而不能一起工作的那些类可以一起工作。
        桥接模式：
            将抽象部分与实现部分分离，使它们可以独立变化
        装饰器模式：
            动态地给一个对象添加一些额外的职责
        组合模式：
            将对象组合成树形结构以表示"部分-整体"的层次结构
        代理模式：
            为其他对象提供一种代理以控制对这个对象的访问
         */

        // 行为型设计模式
        /*
        这类模式是关于对象之间的通信，关注的是对象的职责分配

        策略模式：
            定义了算法族，分别封装起来，让它们之间可以互相替换
        观察者模式：
            定义对象之间的一对多依赖，当一个对象状态改变时，它的所有依赖者都会收到通知并自动更新
        模板方法模式：
            在一个方法中定义一个算法的骨架，而将一些步骤延迟到子类中
        迭代器模式：
            提供一种方法顺序访问一个聚合对象中各个元素, 而又不需暴露该对象的内部表示
         */
    }
}
